Revit 2027 API
ExporterIFCUtils.AreSolidsEqual Method
 Determines whether two solids are identical, potentially offset from each other.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreSolidsEqual(
	Solid first,
	Solid second,
	out Transform trf
)
Public Shared Function AreSolidsEqual (
	first As Solid,
	second As Solid,
	<OutAttribute> ByRef trf As Transform
) As Boolean
public:
static bool AreSolidsEqual(
	Solid^ first,
	Solid^ second,
	[OutAttribute] Transform^% trf
)
static member AreSolidsEqual :
        first : Solid *
        second : Solid *
        trf : Transform byref -> bool
Parameters
first Solid
 The first solid.
second Solid
 The second solid
trf Transform
 The offset transform
Return Value
Boolean
 True if they are identical, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace